Repository: emmnunes/hexaedro.xyz
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: pt_pt

source: Credits
pt_pt: Créditos

source: About
pt_pt: Sobre

source: Hexaedro is an immersive video-art installation, derived from Pedro Vaz's homonymous graduation project at the University of Coimbra Design & Multimedia master's degree.
pt_pt: Hexaedro é uma instalação de vídeo-arte imersiva, iniciada por Pedro Vaz no contexto da unidade curricular de Projecto/Estágio do Mestrado em Design e Multimédia da Universidade de Coimbra.

source: Although the project is conceptually based on the corporate book Fight Gravity - An history of the concepts that radically changed our ways of thinking (Brandia Central, 2009), it is not sponsored by, nor affiliated to, any for-profit organization, and exclusively makes use of either original or licensed resources. As a result, the final artwork is itself licensed for use under a <a href="http://creativecommons.org/licenses/by-nc/3.0/deed.en_US" target="_blank">Creative Commons Attribution-NonCommercial 3.0 Unported License</a>.
pt_pt: Ainda que se baseie conceptualmente no livro Fight Gravity - Uma história dos conceitos que mudaram radicalmente a nossa forma de pensar (Brandia Central, 2009), este projecto não é patrocinado por, nem está associado a, organizações com fins lucrativos, e apenas faz uso de material original ou devidamente licenciado. A obra final encontra-se abrangida por uma <a href="http://creativecommons.org/licenses/by/3.0/" target="_blank">licença Creative Commons Attribution-NonCommercial 3.0 Unported</a>.

source: About the Author
pt_pt: Sobre o Autor

source: Born on the 15th of June 1985, in the Portuguese city of Coimbra, Pedro Vaz soon surrounds himself of transformation proccesses: of shape, figure and senses. At the age of 15 dreams of doing comic books, and at 17 of being an artist. From then on, he starts experimenting with graphic design, illustration, animation and moviemaking. In 2009, he's awarded, along with the Nefasto collective, the Young Portuguese Director award at the Cinanima film festival. In 2010, he joins the University of Coimbra's Design & Multimedia master's degree, where he becomes even more familiar with motion design, all the while gaining professional experience in branding, editorial design, video production and illustration. He sees motion design as the ultimate canvas for his creative ambitions.
pt_pt: Pedro Vaz nasce a 15 de Junho de 1985 em Coimbra. Desde cedo se rodeia dos processos de transformação: da forma, da figura e do sentido. Aos 15 anos quer desenhar BD, aos 17 ser artista plástico. Dai para a frente cria contacto com o design gráfico, ilustração, animação e cinema. Ingressa numa licenciatura em Design e Comunicação Multimédia na ESEC, onde cria com colegas o Colectivo Nefasto. Em 2009 são premiados como Realizadores no Cinanima. Segue em 2010 para o Mestrado em Design Multimédia na U.C, onde ganha maior contacto com o motion-design. Pelo caminho cria contacto profissional em brand design, design editorial, produção videográfica e ilustração. Vê no motion design a forma mais completa de aplicar as suas capacidades criativas.

source: This is not a "one man show". This project would be impossible without the precious help of those that, from the start, believed Hexaedro could come to life – a vast team driven by friendship and the sharing of a will: to do more with less. I am deeply grateful to all of you, especially to a friend of mine without whom, unquestionably, none of this would be possible: Eduardo Nunes, to whom I am happy to return all of the help and, more importantly, the friendship! Not less important: Maria de Lurdes, José Vaz, João Góis, Tiago Andrade, José Monsanto, Ana Baptista, Tiago Ribeiro, Daniel Vaz, Filipe Pires, Nuno Rodrigues, Fernanda Antunes, Miguel Soares, João Bicker, Paulo Gama, Pedro Casaleiro, Carlota Simões, Gilberto Pereira, José Neto, Pedro Rodrigues, Ana Rosa, Rui Valente and Elisabete Maia.
pt_pt: Isto não é um "one man show". Este projecto seria impensável sem a preciosa ajuda daqueles que, desde o início, acreditaram que o Hexaedro poderia tomar forma – uma grande equipa, guiada pela amizade e uma vontade comum: fazer mais, com menos. Estou profundamente grato a todos, em particular a um amigo sem o qual, inquestionavelmente, nada disto teria sido possível: Eduardo Nunes, a quem retribuo toda a ajuda e, acima de tudo, amizade! Não menos importantes: Maria de Lurdes, José Vaz, João Góis, Tiago Andrade, José Monsanto, Ana Baptista, Tiago Ribeiro, Daniel Vaz, Filipe Pires, Nuno Rodrigues, Fernanda Antunes, Miguel Soares, João Bicker, Paulo Gama, Pedro Casaleiro, Carlota Simões, Gilberto Pereira, José Neto, Pedro Rodrigues, Ana Rosa, Rui Valente e Elisabete Maia.

source: To ensure a seamless video experience, the following credits have been omitted from the final artwork:
pt_pt: Para assegurar a integridade da obra, os seguintes créditos foram omitidos do vídeo final:

source: Written, directed and edited by
pt_pt: Escrito, dirigido e produzido por

source: Supervised by
pt_pt: Supervisão de

source: Image Shooting by
pt_pt: Gravação de Vídeo

source: Technical Support by
pt_pt: Apoio Técnico

source: Web Development
pt_pt: Desenvolvimento Web

source: Institutional Support
pt_pt: Apoios Institucionais

source: References and Resources
pt_pt: Referências e Recursos

source: Considering the high number of references used in the project, the previous list includes only the most relevant.
pt_pt: Tendo em consideração a quantidade de referências usadas no projecto, esta lista apresenta apenas as mais relevantes.

source: Contacts
pt_pt: Contactos

source: Please feel free to send any questions you may have through to <a href="http://log.hexaedro.eu/ask" target="_blank">our tumblr</a>, or just get in touch directly with Pedro using any of the following contacts:
pt_pt: Podes submeter perguntas directamente ao criador do projecto através do <a href="http://log.hexaedro.eu/ask" target="_blank">tumblr do projecto</a>, ou entrar directamente em contacto através dos seguintes contactos :

source: Sponsors
pt_pt: Apoios

source: Gallery
pt_pt: Galeria

source: Project by
pt_pt: Projecto de

source: Web development by
pt_pt: Desenvolvimento Web:

source: Simulated setup
pt_pt: Simulação da instalação

source: Promotional poster
pt_pt: Cartaz promocional

source: About the Project
pt_pt: Sobre o Projecto

source: Hexaedro is a 360º video installation, projected on the walls of an hexagonal prism. A video-based artwork centered in mankind evolution.
pt_pt: Hexaedro é uma instalação 360º, projectada nas paredes de um prisma hexagonal. Uma peça de vídeo-arte baseada na evolução do Homem.

source: The Humanist Concept
pt_pt: O Conceito Humanista

source: Hexaedro sums up the global concepts that have been determinant in makind's evolutional process. They are abstract concepts that can be found on the most distinctive areas, contributing for the human evolution, where mathematics plays the main role as a universal language system, making it fundamental for decoding the natural environment. These are abstract and omnipresent ideas that are based on four fundamental pillars: evolution, singularity, creativity and knowledge. These concepts connect and intertwine, creating a continuous chain of thought. From science to philosophy, from mathematics to history, they prove a unifying theory: the concept that "everything is connected".
pt_pt: O projecto Hexaedro resume os conceitos globais determinantes no processo evolutivo da humanidade: conceitos abstractos, que podem ser encontrados nas áreas mais diversas, e cujos contributos para a evolução humana, na qual a matemática se assume como a linguagem universal por excelência, são inegáveis. Tratam-se de ideias abstractas e omnipresentes, baseadas em quatro pilares fundamentais: evolução, singularidade, criatividade e conhecimento. Estes conceitos unem-se e interligam-se, criando uma corrente de pensamento contínua. Da ciência à filosofia, da matemática à história, eles provam uma teoria unificadora: a ideia de que "tudo se interliga".

source: Evolution
pt_pt: Evolução

source: Growth
pt_pt: Crescimento

source: Metamorphosis
pt_pt: Metamorfose

source: Multiplication
pt_pt: Multiplicação

source: Life Cycle / Death
pt_pt: Ciclo de Vida / Morte

source: Past / Future
pt_pt: Passado / Futuro

source: Singularity
pt_pt: Singularidade

source: Individual / Society
pt_pt: Individual / Sociedade

source: Species / Element
pt_pt: Espécie / Elemento

source: Self-Knowledge
pt_pt: Auto-Conhecimento

source: Consciousness
pt_pt: Consciência

source: Creativity
pt_pt: Criatividade

source: Curiosity
pt_pt: Curiosidade

source: Transformation
pt_pt: Transformação

source: Domain
pt_pt: Domínio

source: Composition
pt_pt: Composição

source: Knowledge
pt_pt: Conhecimento

source: Share
pt_pt: Partilha

source: Transmission
pt_pt: Transmissão

source: Learning
pt_pt: Aprendizagem

source: Legacy
pt_pt: Legado

source: University
pt_pt: Universidade

source: Physical Structure
pt_pt: Estrutura Física

source: The Hexaedro project is, in its essence, a motion-design artwork, only with a peculiar set of technical features that make it an out-of-the-ordinary piece. The installation is actually a seamless, 360-degree video. Its presentation is, thus, inseparable from the physical structure that supports it, since the entire video has been produced and edited with the immersive qualities of the final installation in mind, which strives to draw the viewer into the piece itself, establishing a relationship of extreme proximity between the artwork and the viewer. These factors make this an immersive-design piece.
pt_pt: O projeto Hexaedro é na sua essência uma obra de motion-design, contudo as suas características técnicas fazem dele uma peça incomum. A obra é na verdade um vídeo circular, e não pode, pelas suas proporções e pela narrativa, ser exposta de forma planificada, num só plano de projeção. A sua exibição é assim indissociável da estrutura que a suporta, pois toda a edição e comportamento visual foi editado para que o espectador esteja dentro da obra, rodeado pela imagem, numa relação muito próxima entre obra e público. Por esta razão torna-se prioritariamente uma obra de immersive-design.

source: Arena Configuration
pt_pt: Configuração da Arena

source: The hexagonal-shaped structure the project depends on consists of an arena of six, concentrically laid out projection screens, with a 4:3 display ratio each.
pt_pt: A estrutura hexagonal de que o projecto depende consiste numa arena de seis ecrãs de projecção concêntricos, cada um dos quais com uma proporção de imagem 4:3.

source: Isometric View
pt_pt: Vista Isométrica

source: Top View
pt_pt: Vista de Topo

source: Left View
pt_pt: Vista Lateral

source: presskit.png
pt_pt: presskit_pt.png

source: credits.png
pt_pt: credits_pt.png

source: About Hexaedro
pt_pt: Sobre o Hexaedro

source: gallery.png
pt_pt: gallery_pt.png

source: You can follow the project updates through our tumblr, at
pt_pt: Podes acompanhar a evolução do projecto através do tumblr, em

source: Production Process
pt_pt: Processo de Produção

source: While being essentially a video-based work, Hexaedro is not a traditional short film – despite the fact that its execution has gone through similar production processes. Completed in the course of six months, the piece has gone through several production stages: from research and script writing, to video capture, post-production and animation. The software setup used to produce the final piece consisted of Adobe Photoshop, Adobe Illustrator, Adobe After Effects, Maxon Cinema 4D and Sony Vegas.
pt_pt: Apesar de se qualificar como uma obra videográfica, não se trata de uma curta-metragem tipicamente narrativa, no entanto usa processos similares na elaboração dos conteúdos. Concebido em seis meses, o trabalho apresenta várias fazes de execução: desde a investigação, escrita de guião e storyboard, à produção pratica da captação de imagens, tratamento e animação de conteúdos. Digitalmente foi conseguido com recurso aos softwares: Adobe Photoshop, Adobe Illustrator, Adobe After Effects, Maxon Cinema 4D e Sony Vegas.

source: Research<br />and Writing
pt_pt: Pesquisa<br />e Escrita

source: Concept Art<br />and Storyboard
pt_pt: Concept Art<br />e Storyboard

source: Animating<br />and Editing
pt_pt: Animação<br />e Edição

source: Construction<br />and Assembly
pt_pt: Construção<br />e Montagem

source: Production was preceeded by a research process, which went through the main concepts behind the theory of evolution. This allowed the storyboard to take form, while providing valuable theoretical and visual resources, which would be employed at a later stage.
pt_pt: A execução é iniciada com o levantamento dos principais conceitos evolucionistas, a recolha das matériais, teóricas e gráficas, necessárias para o alinhamento narrativo e escrita do guião.

source: Having finished the script, all of the scenes were visually rehearsed. Both the tone and style of the movie were carefully tested, and validated through the use of quick sketches and concept-art.
pt_pt: Definido o guião, são estruturadas visualmente as cenas e a transição de elementos. O tom e o estilo visual do filme são ensaiados na arte-conceptual das principais cenas a integrar a obra.

source: Taking advantage of a vast array of graphical resources, the seven main scenes were produced and edited in a continuous, yet non-linear storyline. While some of the scenes are entirely computer-generated, others make use of live action video.
pt_pt: Recorrendo a um vasto leque de recursos gráficos, construiram-se as sete cenas de forma continua, mas não linear. Algumas cenas são inteiramente digitais e outras recorrem a captura de imagem real.

source: The projection setup was initially built at a smaller scale, for testing and concept-validation purposes, during the production proccess. A larger, real-scale prism was then built for public exhibition. The projection equipment consists of six Benq MX660 video projectors and two Matrox ThreeHead2go video cards.
pt_pt: A arena metálica de projecção conheceu duas versões, uma em escala reduzida, para ensaios durante o processo de edição, e a final, à escala real, construida para exposição pública. O equipamento de projecção é formado por seis projectores Benq MX660 e duas placas de video Matrox ThreeHead2go.

source: A 360º immersive installation
pt_pt: Uma instalação imersiva 360º

source: Born out of a graduation project, at the University of Coimbra's Design & Multimedia master's degree, Hexaedro reflects its author's ambition to go beyond the traditional frontiers imposed by video: it's an immersive design installation, composed of six, sequentially contiguous projection walls, together forming an hexagonal prism, without a floor or a ceiling, on which a seamless 360º video is projected. The viewers are invited into the center of the structure, from where they're able to watch, from all directions, the unfolding of a concise history of mankind. The concentric setup, by putting the viewer right at the center of the piece, begins to unveil the work's central theme: a humanist overview of concepts relating to the evolution of mankind, as unique and social beings, as an individual and as species. It's a non-narrated, purely-visual art piece, that seeks to tell its tale exclusively through the power of images and universal symbology: the evolution of the species, the discovery of fire, the progress and achievemnts that make our species unique.
pt_pt: Nasce como projeto final de mestrado em Design Multimédia, na Universidade de Coimbra, a vontade de fazer do video algo que extrapole as barreiras convencionais que este meio apresenta. Pedro Vaz, então finalista, desenvolve o Hexaedro, uma peça cénica de Design Imersivo, que na sua composição forma uma arena hexagonal, um video panorâmico a 360 graus é projectado nas seis paredes da estrutura. Os espectadores são transportados para o seu interior, onde assistem de pé, ao desenlace da obra. A disposição concêntrica que faz do espectador interveniente, lança uma pista sobre o tema da obra: Uma visão humanista sobre os conceitos intrínsecos à evolução da humanidade, como ser singular e como colectivo social, como individuo e como espécie. É um vídeo sem narração, nem texto, que transmite pelo poder da imagem e de simbologia universal a escalada da vida: a evolução das espécies, descoberta do fogo, o progresso e os feitos que definem a nossa espécie como única.

source: DOWNLOAD PRESS KIT
pt_pt: DESCARREGAR PRESS KIT

source: Press release, in English and Portuguese
pt_pt: Press release, em Português e Inglês

source: Author biography
pt_pt: Biografia do autor

source: High resolution photos
pt_pt: Fotos de alta resolução

source: Technical project description
pt_pt: Descrição técnica do projecto

source: Synopsis
pt_pt: Sinopse

source: Hexaedro tells the tale of the concepts underlying the evolution of Man, as a social and unique being. From thought to practice, from the idea to the execution, the milestones that tell us "everything is connected". It's a story of abstract concepts, cornerstones of our Humanity: the Evolution of species, the individual's Singularity, the Creativity to shape our environment and the transmission of Knowledge.
pt_pt: Hexaedro é a história dos conceitos que sustentam a evolução do ser Humano, como ser social e como indivíduo único. Do pensamento à prática, da ideia à execução, os "milestones" que demonstram que "everything is connected". É a obra dos conceitos abstratos, tão basilares à Humanidade: a Evolução das espécies, a Singularidade do indivíduo, a Criatividade para moldar o meio e a transmissão de Conhecimento.
